Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.analysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.objectAttachedToID
The identifier of the object the load is attached to.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.objectAttachedToType
The type of the object the load is attached to.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.modelLoadID
The identifier of the model load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.modelLoadGroupID
The identifier of the model load group.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.analysisLoadType
The type of the analysis decomposed load.